# St7NewBeamProperty

Creates a new beam property.

Properties – Beams, Plates and Bricks

long St7NewBeamProperty(long uID, long PropNum, long BeamType, char* PropName)

Input Parameters

uID

Strand7 model file ID.

PropNum

Property number.

BeamType

One of btSpring, btCable, btTruss, btCutoff, btContact, btBeam, btUser, btPipe or btConnection.

PropName

Name of the property.